Revit 2026 API
ElementPhaseStatusFilter Constructor
Overload List
Name | Description
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) |  Constructs a new instance of a file to match elements that have a given phase status on the input phase.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>) | Initializes a new instance of the ElementPhaseStatusFilter class
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean) |  Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>, Boolean) | Initializes a new instance of the ElementPhaseStatusFilter class
Top
See Also
Reference
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace